In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../OriginalData/tb.csv')
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df.columns = list(df.columns[0:3]) + [c[7:] for c in df.columns[3:]]
df.head()

,iso2,year,new_sp,m04,m514,m014,m1524,m2534,m3544,m4554,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df.fillna(0, inplace=True)
df.head()

,iso2,year,new_sp,m04,m514,m014,m1524,m2534,m3544,m4554,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AD,1990,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AD,1991,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AD,1992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AD,1993,15.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [5]:
df.drop('m014', axis=1, inplace=True)
df.drop('f014', axis=1, inplace=True)
df.drop('new_sp', axis=1, inplace=True)
df.drop('mu', axis=1, inplace=True)
df.drop('fu', axis=1, inplace=True)
df.head()

,iso2,year,m04,m514,m1524,m2534,m3544,m4554,m5564,m65,f04,f514,f1524,f2534,f3544,f4554,f5564,f65
0,AD,1989,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AD,1990,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AD,1991,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AD,1992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AD,1993,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [6]:
df = df.melt(id_vars=['iso2', 'year'], var_name='sex_age', value_name='cases')
df.head()

  iso2  year sex_age  cases
0   AD  1989     m04    0.0
1   AD  1990     m04    0.0
2   AD  1991     m04    0.0
3   AD  1992     m04    0.0
4   AD  1993     m04    0.0

In [7]:
df['sex'] = df['sex_age'].str[0]
df['age'] = pd.to_numeric(df['sex_age'].str[1:])
df.head()

  iso2  year sex_age  cases sex  age
0   AD  1989     m04    0.0   m    4
1   AD  1990     m04    0.0   m    4
2   AD  1991     m04    0.0   m    4
3   AD  1992     m04    0.0   m    4
4   AD  1993     m04    0.0   m    4

In [8]:
df.drop('sex_age', axis=1, inplace=True)
df.head()

  iso2  year  cases sex  age
0   AD  1989    0.0   m    4
1   AD  1990    0.0   m    4
2   AD  1991    0.0   m    4
3   AD  1992    0.0   m    4
4   AD  1993    0.0   m    4

In [9]:
df = df.groupby(['iso2', 'year', 'age', 'sex']).sum()
# df = pd.pivot_table(df, index=['iso2', 'year', 'age', 'sex'], values='cases', aggfunc=np.sum)
df.drop(0, axis=0, inplace=True)
df.head(20)

                    cases
iso2 year age  sex
AD   1989 4    f      0.0
               m      0.0
          65   f      0.0
               m      0.0
          514  f      0.0
               m      0.0
          1524 f      0.0
               m      0.0
          2534 f      0.0
               m      0.0
          3544 f      0.0
               m      0.0
          4554 f      0.0
               m      0.0
          5564 f      0.0
               m      0.0
     1990 4    f      0.0
               m      0.0
          65   f      0.0
               m      0.0

In [14]:
for row in df.iterrows():
    if row[0][2] == 65:
        row = ((row[0][1:2], 65100, row[0][3:]), row[1])
        
df.head(20)

                    cases
iso2 year age  sex
AD   1989 4    f      0.0
               m      0.0
          65   f      0.0
               m      0.0
          514  f      0.0
               m      0.0
          1524 f      0.0
               m      0.0
          2534 f      0.0
               m      0.0
          3544 f      0.0
               m      0.0
          4554 f      0.0
               m      0.0
          5564 f      0.0
               m      0.0
     1990 4    f      0.0
               m      0.0
          65   f      0.0
               m      0.0